Revit 2027 API
BuiltInFailures.SketchFailures.PathCannotBeClosedLoop Property
 Path cannot be a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathCannotBeClosedLoop { get; }
Public Shared ReadOnly Property PathCannotBeClosedLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathCannotBeClosedLoop {
	FailureDefinitionId^ get ();
}
static member PathCannotBeClosedLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace